app/controllers/post_controller.rb

  def insert_user
    name = params[:name]
    email = params[:email]
    render :json => User.create(:name => name, :email => email)
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 17 Nov 2012 09:51:41 UTC +00:00], ["email", "marwi"], ["name", "Marcus"], ["updated_at", Sat, 17 Nov 2012 09:51:41 UTC +00:00]]