app/controllers/test_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" IN (SELECT "users"."id" FROM "users" WHERE "users"."name" = '"Marcus"')
---
  def get_posts_by_user
    name = params[:name]
    render :json => User.where(:name => name)

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 10 Nov 2012 14:39:25 UTC +00:00], ["email", "MinEmail"], ["name", "Marcus2"], ["updated_at", Sat, 10 Nov 2012 14:39:25 UTC +00:00]]
---
  def insert_user
    name = params[:name]
    email = params[:email]
    render :json => User.create(:name => name, :email => email)

SELECT "channels".* FROM "channels" WHERE "channels"."name" = 'channel_name'
INSERT INTO "programs" ("channel_id", "created_at", "description", "duration", "name", "shortdescription", "starttime", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def insert_program
    name = params[:name]
    duration = params[:duration]
    start_time = params[:starttime]
    description = params[:description]
    short_description = params[:shortdescription]
    channel_name = params[:channel_name]
    theChannel = Channel.where(:name => channel_name)

    theProgram = Program.new
    theProgram.name = name
    theProgram.duration = Time.parse(duration)
    theProgram.starttime = DateTime.parse(start_time)
    theProgram.description = description
    theProgram.shortdescription = short_description

    theProgram.channel_id = theChannel
    render :json => theProgram.save

INSERT INTO "channels" ("channelURL", "created_at", "iconURL", "name", "program_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["channelURL", "bbc"], ["created_at", Sat, 10 Nov 2012 15:13:33 UTC +00:00], ["iconURL", "url"], ["name", "BBC"], ["program_id", nil], ["updated_at", Sat, 10 Nov 2012 15:13:33 UTC +00:00]]
---
  def insert_channel
    name = params[:name]
    iconURL = params[:iconURL]
    channelURL = params[:channelURL]
    theChannel = Channel.new
    theChannel.name = name
    theChannel.iconURL = iconURL
    theChannel.channelURL = channelURL
    render :json => theChannel.save

SELECT "users".* FROM "users" WHERE "users"."name" = 'Marcus2'
INSERT INTO "posts" ("content", "created_at", "program_id", "timestamp", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def insert_post
    username = params[:username]
    program_name = params[:program_name]
    content = params[:content]
    timestamp = DateTime.parse(params[:timestamp])

    theUser = User.where(:name => username)
    if theUser != []
      theProgram = Program.where(:name => program_name)

      thePost = Post.new
      thePost.user = theUser
      thePost.program = theProgram
      thePost.content = content
      thePost.timestamp = timestamp
      render :json => thePost.save